Can't find a host for Fabric Sheet.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotPlaceFabricSheet { get; }
  Visual Basic
Public Shared ReadOnly Property CannotPlaceFabricSheet As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotPlaceFabricSheet {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FabricFailures Class
  Autodesk.Revit.DB Namespace